{
  "added_tokens_decoder": {},
  "auto_map": {
    "AutoTokenizer": [
      "tokenization_qwen.QWenTokenizer",
      null
    ]
  },
  "clean_up_tokenization_spaces": true,
  "model_max_length": 8000,
  "pad_token": "<|endoftext|>",
  "padding_side": "right",
  "tokenizer_class": "QWenTokenizer"
}
